Revit 2027 API
IConnector.Radius Property
The radius of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
double Radius { get; }
ReadOnly Property Radius As Double
	Get
property double Radius {
	double get ();
}
abstract Radius : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the connector's shape is not round.
Remarks
This property is used to retrieve the radius of the connector.
See Also
Reference
IConnector Interface
Autodesk.Revit.DB Namespace